{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.1.0", "signature": {"inputs": {"rescaling_input:0": {"name": "rescaling_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/rescaling/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/rescaling/Cast_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "86528"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rescaling_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/rescaling/mul", "op": "Mul", "input": ["rescaling_input", "StatefulPartitionedCall/sequential_1/rescaling/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/rescaling/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/rescaling/mul", "StatefulPartitionedCall/sequential_1/rescaling/Cast_1/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/rescaling/add", "StatefulPartitionedCall/sequential_1/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d/MaxPool", "StatefulPartitionedCall/sequential_1/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/sequential_1/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/flatten/Reshape", "StatefulPartitionedCall/sequential_1/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense/Relu", "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_1/Relu", "StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_2/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of86.bin", "group1-shard2of86.bin", "group1-shard3of86.bin", "group1-shard4of86.bin", "group1-shard5of86.bin", "group1-shard6of86.bin", "group1-shard7of86.bin", "group1-shard8of86.bin", "group1-shard9of86.bin", "group1-shard10of86.bin", "group1-shard11of86.bin", "group1-shard12of86.bin", "group1-shard13of86.bin", "group1-shard14of86.bin", "group1-shard15of86.bin", "group1-shard16of86.bin", "group1-shard17of86.bin", "group1-shard18of86.bin", "group1-shard19of86.bin", "group1-shard20of86.bin", "group1-shard21of86.bin", "group1-shard22of86.bin", "group1-shard23of86.bin", "group1-shard24of86.bin", "group1-shard25of86.bin", "group1-shard26of86.bin", "group1-shard27of86.bin", "group1-shard28of86.bin", "group1-shard29of86.bin", "group1-shard30of86.bin", "group1-shard31of86.bin", "group1-shard32of86.bin", "group1-shard33of86.bin", "group1-shard34of86.bin", "group1-shard35of86.bin", "group1-shard36of86.bin", "group1-shard37of86.bin", "group1-shard38of86.bin", "group1-shard39of86.bin", "group1-shard40of86.bin", "group1-shard41of86.bin", "group1-shard42of86.bin", "group1-shard43of86.bin", "group1-shard44of86.bin", "group1-shard45of86.bin", "group1-shard46of86.bin", "group1-shard47of86.bin", "group1-shard48of86.bin", "group1-shard49of86.bin", "group1-shard50of86.bin", "group1-shard51of86.bin", "group1-shard52of86.bin", "group1-shard53of86.bin", "group1-shard54of86.bin", "group1-shard55of86.bin", "group1-shard56of86.bin", "group1-shard57of86.bin", "group1-shard58of86.bin", "group1-shard59of86.bin", "group1-shard60of86.bin", "group1-shard61of86.bin", "group1-shard62of86.bin", "group1-shard63of86.bin", "group1-shard64of86.bin", "group1-shard65of86.bin", "group1-shard66of86.bin", "group1-shard67of86.bin", "group1-shard68of86.bin", "group1-shard69of86.bin", "group1-shard70of86.bin", "group1-shard71of86.bin", "group1-shard72of86.bin", "group1-shard73of86.bin", "group1-shard74of86.bin", "group1-shard75of86.bin", "group1-shard76of86.bin", "group1-shard77of86.bin", "group1-shard78of86.bin", "group1-shard79of86.bin", "group1-shard80of86.bin", "group1-shard81of86.bin", "group1-shard82of86.bin", "group1-shard83of86.bin", "group1-shard84of86.bin", "group1-shard85of86.bin", "group1-shard86of86.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/rescaling/Cast/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/rescaling/Cast_1/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d/Conv2D/ReadVariableOp", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/dense/MatMul/ReadVariableOp", "shape": [86528, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense/BiasAdd/ReadVariableOp", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "shape": [1024, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "shape": [1024, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}]}]}